package day13;

public class Info {
    /**
     * 张皓岚
     * 什么是集合
     * 集合就是java提供的能够保存多个对象的对象
     * 为什么需要集合
     * 因为同样具有保存多个数据的数组类型操作比较麻烦
     * 删除数组元素后面元素要前移
     * 添加数组元素要找到空位置
     * 数组长度满了再想添加还要扩容
     * 使用集合就不需要考虑上面的问题了
     * java集合基本状态
     * java.util.Collection接口，这个接口规定了集合中数据的基本操作方法有哪些
     * 例如新增数据，删除数据，数据扩容，以及返回当前集合中的元素数量
     * 在Collection接口基础上，java又根据不同的数据结构声明了两个子接口
     * java.util.List
     * java.util.Set
     * List:数据结构为“线性表”：特点是可以有序的存放一组数据，这些数据中允许重复数据出现
     *      简单来说：有序，不唯一
     * Set:数据结构为“不可重复集”：特点是存放的数据无序，不允许存放在这个集合中的数据出现重复现象
     *      简单来说：无序，唯一
     *
     *
     * 集合保存引用类型对象时的数据结构
     *
     *
     *
     */

}
